$(function() {

    Morris.Area({
        element: 'morris-area-chart',
        data: [{
            time: '2010 Q1',
            语文: 86,
            数学: 88,
            英语: 81
        }, {
            time: '2010 Q2',
            语文: 80,
            数学: 90,
            英语: 85
        }, {
            time: '2010 Q3',
            语文: 82,
            数学: 86,
            英语: 91
        }, {
            time: '2010 Q4',
            语文: 81,
            数学: 82,
            英语: 83
        }, {
            time: '2011 Q1',
            语文: 87,
            数学: 79,
            英语: 89
        }, {
            time: '2011 Q2',
            语文: 78,
            数学: 93,
            英语: 84
        }, {
            time: '2011 Q3',
            语文: 83,
            数学: 88,
            英语: 90
        }, {
            time: '2011 Q4',
            语文: 84,
            数学: 82,
            英语: 81
        }, {
            time: '2012 Q1',
            语文: 87,
            数学: 88,
            英语: 89
        }, {
            time: '2012 Q2',
            语文: 84,
            数学: 85,
            英语: 86
        }],
        xkey: 'time',
        ykeys: ['语文', '数学', '英语'],
        labels: ['语文', '数学', '英语'],
        pointSize: 2,
        hideHover: 'auto',
        resize: true
    });


});
